InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КурсыВалют/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	
	#Если Клиент Тогда
		
	мВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();

	Для Каждого СтрокаНабораЗаписей Из ЭтотОбъект Цикл
		Если СтрокаНабораЗаписей.Валюта = мВалютаРегламентированногоУчета Тогда 
			Если СтрокаНабораЗаписей.Кратность <> 1 ИЛИ СтрокаНабораЗаписей.Курс <> 1 Тогда 
				Режим = РежимДиалогаВопрос.ДаНет;
				Текст = "ru = ""В поле кратность или курс введено ошибочное значение, значение должно быть равным «1». Продолжить?""";
				Ответ = Вопрос(НСтр(Текст), Режим, 60, , "Внимание!!!",); 				
				Если Ответ = КодВозвратаДиалога.Нет Тогда 
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
		
	#КонецЕсли
   	
КонецПроцедуры
